In [1]:
import pandas as pd

In [8]:
df = pd.read_csv('../Data/movie.features.complete.filtered.csv')

In [9]:
df.head(5)

,tconst,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres,averageRating,numVotes,popularIsOriginal,...,Mystery,News,Reality-TV,Romance,Sci-Fi,Sport,Talk-Show,Thriller,War,Western
0,tt0001184,Don Juan de Serrallonga,Don Juan de Serrallonga,0,1910,58,"Adventure,Drama",3.8,21,1,...,0,0,0,0,0,0,0,0,0,0
1,tt0001498,The Battle of Trafalgar,The Battle of Trafalgar,0,1911,51,War,7.8,14,1,...,0,0,0,0,0,0,0,0,1,0
2,tt0001790,"Les Misérables, Part 1: Jean Valjean",Les misérables - Époque 1: Jean Valjean,0,1913,60,Drama,6.0,52,0,...,0,0,0,0,0,0,0,0,0,0
3,tt0001911,Nell Gwynne,Sweet Nell of Old Drury,0,1911,50,"Biography,Drama,History",3.6,24,0,...,0,0,0,0,0,0,0,0,0,0
4,tt0002199,From the Manger to the Cross,From the Manger to the Cross,0,1912,60,"Biography,Drama",5.8,624,1,...,0,0,0,0,0,0,0,0,0,0

## Genres

In [11]:
df.columns

Index(['tconst', 'primaryTitle', 'originalTitle', 'isAdult', 'startYear',
       'runtimeMinutes', 'genres', 'averageRating', 'numVotes',
       'popularIsOriginal', 'avgRatingPerFilmActors',
       'avgNumVotesPerFilmActors', 'avgRatingPerFilmProducers',
       'avgNumVotesPerFilmProducers', 'avgRatingPerFilmCrew',
       'avgNumVotesPerFilmCrew', 'numberOfTranslations', 'Action', 'Adult',
       'Adventure', 'Animation', 'Biography', 'Comedy', 'Crime', 'Documentary',
       'Drama', 'Family', 'Fantasy', 'Film-Noir', 'History', 'Horror', 'Music',
       'Musical', 'Mystery', 'News', 'Reality-TV', 'Romance', 'Sci-Fi',
       'Sport', 'Talk-Show', 'Thriller', 'War', 'Western'],
      dtype='object')

In [14]:
df[df['tconst']=='tt0001184'][['genres','Action', 'Adult',
       'Adventure', 'Animation', 'Biography', 'Comedy', 'Crime', 'Documentary',
       'Drama', 'Family', 'Fantasy', 'Film-Noir']]

,genres,Action,Adult,Adventure,Animation,Biography,Comedy,Crime,Documentary,Drama,Family,Fantasy,Film-Noir
0,"Adventure,Drama",0,0,1,0,0,0,0,0,1,0,0,0

In [15]:
df[df['tconst']=='tt0001184'][['genres','Action','History', 'Horror', 'Music',
       'Musical', 'Mystery', 'News', 'Reality-TV', 'Romance', 'Sci-Fi',
       'Sport', 'Talk-Show', 'Thriller', 'War', 'Western']]

,genres,Action,History,Horror,Music,Musical,Mystery,News,Reality-TV,Romance,Sci-Fi,Sport,Talk-Show,Thriller,War,Western
0,"Adventure,Drama",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0

## Actors, Producers and Crew

In [19]:
df_principals = pd.read_csv('../Data/title.principals.tsv', delimiter='\t')

In [43]:
df_ratings = pd.read_csv('../Data/title.ratings.tsv', delimiter='\t')

In [44]:
df_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      2007
1  tt0000002            5.8       270
2  tt0000003            6.5      1920
3  tt0000004            5.5       178
4  tt0000005            6.2      2695

In [40]:
df_titles = pd.read_csv('../Data/title.basics.tsv', delimiter='\t') #join ratings

C:\TEMP\ipykernel_7280\450410568.py:1: DtypeWarning: Columns (4) have mixed types. Specify dtype option on import or set low_memory=False.
  df_titles = pd.read_csv('../Data/title.basics.tsv', delimiter='\t')

In [49]:
df_titles_ratings = df_titles.merge(df_ratings, on='tconst', how='left')

In [50]:
df_titles_ratings.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,averageRating,numVotes
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short",5.7,2007.0
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short",5.8,270.0
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance",6.5,1920.0
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short",5.5,178.0
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short",6.2,2695.0

In [51]:
df_principals.head(5)

,tconst,ordering,nconst,category,job,characters
0,tt0000001,1,nm1588970,self,\N,"[""Self""]"
1,tt0000001,2,nm0005690,director,\N,\N
2,tt0000001,3,nm0374658,cinematographer,director of photography,\N
3,tt0000002,1,nm0721526,director,\N,\N
4,tt0000002,2,nm1335271,composer,\N,\N

In [21]:
df_principals[df_principals['tconst']=='tt0001184']

         tconst  ordering     nconst         category   job characters
4635  tt0001184         1  nm0699807          actress    \N         \N
4636  tt0001184         2  nm0735618            actor    \N         \N
4637  tt0001184         3  nm0063413         director    \N         \N
4638  tt0001184         4  nm0550220         director    \N         \N
4639  tt0001184         5  nm0049370           writer  play         \N
4640  tt0001184         6  nm0063412  cinematographer    \N         \N

In [ ]:
actors = ['actress', 'actor', 'self']
producers = ['writer', 'director', 'producer']
crew = ['composer', 'editor', 'cinematographer', 'archive_sound', 'production_designer', 'archive_footage']

In [37]:
df_principals[df_principals['nconst']=='nm0699807']['tconst']

4635     tt0001184
27687    tt0004892
Name: tconst, dtype: object

In [52]:
df_titles_ratings[df_titles_ratings['tconst']=='tt0004892']

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,averageRating,numVotes
4831,tt0004892,movie,El amor hace justicia,El amor hace justicia,0,1915,\N,\N,\N,NaN,NaN

In [63]:
df_titles_ratings[df_titles_ratings['tconst'].isin(df_principals[df_principals['nconst']=='nm0699807']['tconst'])][['tconst','averageRating','numVotes', 'genres']]

         tconst  averageRating  numVotes           genres
1172  tt0001184            3.8      21.0  Adventure,Drama
4831  tt0004892            NaN       NaN               \N

In [64]:
df_titles_ratings[df_titles_ratings['tconst'].isin(df_principals[df_principals['nconst']=='nm0735618']['tconst'])][['tconst','averageRating','numVotes', 'genres']]

           tconst  averageRating  numVotes           genres
667     tt0000674            4.6      51.0      Drama,Short
1172    tt0001184            3.8      21.0  Adventure,Drama
24165   tt0024588            NaN       NaN               \N
25754   tt0026212            NaN       NaN            Drama
27685   tt0028185            4.9       8.0               \N
202651  tt0211291            NaN       NaN               \N

In [67]:
print((3.8+4.6+3.8+4.9)/4)
print((3.8+((4.6+3.8+4.9)/3))/2)

print((3.8+4.6+3.8)/3)
print((3.8+((4.6+3.8)/2))/2)

print((4.6+3.8+4.9)/3)

4.275
4.116666666666666
4.066666666666666
3.9999999999999996
4.433333333333333

In [68]:
df[df['tconst']=='tt0001184'][['avgRatingPerFilmActors','avgNumVotesPerFilmActors', 'avgRatingPerFilmProducers','avgNumVotesPerFilmProducers', 'avgRatingPerFilmCrew','avgNumVotesPerFilmCrew']]

,avgRatingPerFilmActors,avgNumVotesPerFilmActors,avgRatingPerFilmProducers,avgNumVotesPerFilmProducers,avgRatingPerFilmCrew,avgNumVotesPerFilmCrew
0,4.533333,25.333333,4.533333,25.333333,5.7,22.4

In [ ]:
df[df['tconst'].isin(df_principals[df_principals['nconst']=='nm0699807']['tconst'])][['tconst','averageRating','numVotes']]